
USE SQLDB;

-- ------------------------------------------------
-- ## 연습 테이블 일괄 삭제 및 생성
-- ------------------------------------------------

SOURCE C:\1Day SQL(MySQL)\1Day SQL 환경구축\01. 테이블\X-02. 연습 테이블 일괄삭제.sql;
SOURCE C:\1Day SQL(MySQL)\1Day SQL 환경구축\01. 테이블\X-01. 연습 테이블 일괄생성.sql;

-- ------------------------------------------------
-- ## 연습 데이터 일괄 생성
-- ------------------------------------------------

SOURCE C:\1Day SQL(MySQL)\1Day SQL 환경구축\02. 데이터\X-01. 연습 데이터 일괄생성.sql;

-- ------------------------------------------------
-- ## 실무 테이블 일괄 삭제 및 생성
-- ------------------------------------------------

SOURCE C:\1Day SQL(MySQL)\1Day SQL 환경구축\04. 실무 테이블\X-02. 실무 테이블 일괄삭제.sql;
SOURCE C:\1Day SQL(MySQL)\1Day SQL 환경구축\04. 실무 테이블\X-01. 실무 테이블 일괄생성.sql;

-- ------------------------------------------------
-- ## 실무 데이터 일괄 생성
-- ------------------------------------------------

SOURCE C:\1Day SQL(MySQL)\1Day SQL 환경구축\05. 실무 데이터\X-01. 실무 데이터 일괄생성.sql;

-- ------------------------------------------------
-- ## 사용자 함수 아래의 파일 찾아 별로도 실행해 주세요.
-- ------------------------------------------------

-- C:\1Day SQL(MySQL)\1Day SQL 연습 함수 생성 #1 (일반).sql
-- C:\1Day SQL(MySQL)\1Day SQL 연습 함수 생성 #2 (실무).sql